lib/tasks/dev.rake

SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types"
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."description" = ? AND "mining_types"."acronym" = ? LIMIT ?  [["description", "Proof of Work"], ["acronym", "PoW"], ["LIMIT", 1]]
SELECT  "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_image" = ? AND "coins"."mining_type_id" IN (SELECT "mining_types"."id" FROM "mining_types" WHERE "mining_types"."acronym" = ?) LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", "https://logospng.org/wp-content/uploads/bitcoin.png"], ["acronym", "PoW"], ["LIMIT", 1]]
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)
---
  task add_coins: :environment do
    show_spinner("Cadastrando moedas...") do
      coins = [
          {
              description: "Bitcoin",
              acronym: "BTC",
              url_image: "https://logospng.org/wp-content/uploads/bitcoin.png",
              mining_type: MiningType.find_by(acronym: 'PoW')
          },
          {
              description: "Ethereum",
              acronym: "ETH",
              url_image: "https://w7.pngwing.com/pngs/932/233/png-transparent-ethereum-blockchain-bitcoin-logo-bitcoin-angle-triangle-logo.png",
              mining_type: MiningType.all.sample
          },
          {
              description: "Dash",
              acronym: "DASH",
              url_image: "https://pngimage.net/wp-content/uploads/2018/05/dash-coin-logo-png-4.png",
              mining_type: MiningType.all.sample
          },
          {
              description: "Iota",
              acronym: "IOT",
              url_image: "https://s2.coinmarketcap.com/static/img/coins/200x200/1720.png",
              mining_type: MiningType.all.sample
          },
          {
              description: "ZCash",
              acronym: "ZEC",
              url_image: "https://img2.gratispng.com/20180628/ohj/kisspng-zcash-cryptocurrency-bitcoin-market-capitalization-btc-digital-llc-5b34e3913bff74.5774957615301927852458.jpg",
              mining_type: MiningType.all.sample
          }
      ]
      coins.each do|coin|
        Coin.find_or_create_by!(coin)

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2020-08-05 23:47:00.432406"], ["updated_at", "2020-08-05 23:47:00.432406"]]
---
  task add_mining_types: :environment do
    show_spinner("Cadastrando tipos de mineração...") do
      mining_types=[
          {description: "Proof of Work", acronym: "PoW"},
          {description: "Proof of Stake", acronym: "PoS"},
          {description: "Proof of Capacity", acronym: "PoC"}
      ]
      mining_types.each do|mining_type|
        MiningType.find_or_create_by!(mining_type)