app/controllers/coins_controller.rb

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "url_image" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["url_image", "https://pngimage.net/wp-content/uploads/2018/05/dash-coin-logo-png-4.png"], ["updated_at", "2020-05-24 18:33:21.494295"], ["id", 4]]